app/controllers/user_books_controller.rb

SELECT "user_books".* FROM "user_books"
---
  def index
    @user_books = UserBook.all

INSERT INTO "user_books" ("user_id", "integer", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "1"], ["integer", "2"], ["book_id", 2], ["created_at", "2025-09-13 20:14:43.165530"], ["updated_at", "2025-09-13 20:14:43.165530"]]
---
  def create
    @user_book = UserBook.new(user_book_params)

    respond_to do |format|
      if @user_book.save

SELECT "user_books".* FROM "user_books" WHERE "user_books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_user_book
      @user_book = UserBook.find(params[:id])